#### NewProjectDocument Method

---

|  |
| --- |
| Application Class   See Also |

New project document

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual Document NewProjectDocument( 	string templateFileName ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function NewProjectDocument ( _ 	templateFileName As String _ ) As Document ``` |

| Visual C++ |
| --- |
| ``` public: virtual Document^ NewProjectDocument( 	String^ templateFileName ) ``` |

#### Parameters

templateFileName
:   Type:  System String
     The template file name.

# Remarks

This command corresponds to New->Project command in the user-interface.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | If 'templateFileName' is    a null reference (  Nothing  in Visual Basic)  or an empty string. |
| Autodesk.Revit.Exceptions InvalidOperationException | If the new project document cannot be created. |

# See Also

Application Class

NewProjectDocument Overload

Autodesk.Revit.ApplicationServices Namespace